# "Заглушаем" или подавляем вывод команд в консоль при выполнении этих команд 
# (в данном случае применяется глобально)
.SILENT:

# Автоматическое форматирование кода
fmt: 
	go fmt ./...

# Линтинг запускает "линтеры" для анализа кода на предмет ошибок
lint: fmt
	go vet ./...

# go vet - фокусируется на выявлении конструкций, указываюших на проблемы с логикой
# golint - сосредоточем на более мелких деталях, таких как проверки стиля кодирования 

# Выполняет тесты для всех пакетов в нашем проекте 
# можно добавить к go test ./... -cover , он будет выводить информацию о покрытии кода тестами
test: lint
	go test -v -cover ./...

# Скомпилирует исполняемый файл в данное название
run: test
	go run ./cmd/lem-in/main.go examples/example05.txt 

# Выполняет команды вне зависимости от того, есть ли в проекте файлы с данными ниже именами
.PHONY: fmt lint test build

.DEFAULT_GOAL := run